Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetRestrictGroup(System.Boolean)
This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Please use the `SetRestrictPalette` method instead.
Since:
2020

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetGroupId(System.Int32)
This method is deprecated in Revit 2022 and may be removed in a future version of Revit.
Please use the `SetPaletteId` method instead.
Since:
2018.2